# Handling Missing Data

We would look at a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'X':[19,26,np.nan],
                  'Y':[53,np.nan,np.nan],
                  'Z':[11,20,36]})

In [3]:
df

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20
2   NaN   NaN  36

In [4]:
df.shape

(3, 3)

In [9]:
# The dropna method removes rows or columns containing np.nan
df.dropna(axis = 0)

      X     Y   Z
0  19.0  53.0  11

In [7]:
df

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20
2   NaN   NaN  36

In [8]:
# axis is set to 0 by default
df.dropna(axis=1)

    Z
0  11
1  20
2  36

In [25]:
#the threshold argument specifies the number of NON 'NAN' values a row or column must contain to remain unremoved 
df.dropna(axis = 0, thresh=2)

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20

In [28]:
df.dropna(thresh=2, axis = 1)

      X   Z
0  19.0  11
1  26.0  20
2   NaN  36

In [30]:
df.fillna?

In [31]:
# we can use the fillna methos to replace np.nan with another value
df.fillna(value= 60)

      X     Y   Z
0  19.0  53.0  11
1  26.0  60.0  20
2  60.0  60.0  36

In [32]:
df

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20
2   NaN   NaN  36

In [34]:
df[['X']].mean()

X    22.5
dtype: float64

In [35]:
df[['X']].fillna(df[['X']].mean())

      X
0  19.0
1  26.0
2  22.5

In [36]:
df['X'] =df['X'].fillna(value=df['X'].mean())
df

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20
2  22.5   NaN  36

In [39]:
# fillna can also take argument 'method' by which we specify how the nan value should be replaced. ffill and bfill are possible options
df.fillna(method='ffill')

      X     Y   Z
0  19.0  53.0  11
1  26.0  53.0  20
2  22.5  53.0  36

In [38]:
df.fillna(method='bfill')

      X     Y   Z
0  19.0  53.0  11
1  26.0   NaN  20
2  22.5   NaN  36

# Aggregating Data with Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [2]:
# Create dataframe
import pandas as pd
data = {'Company':['GOOGLE','GOOGLE','MICROSOFT','FACEBOOK','FACEBOOK','AMAZON','AMAZON'],
       'Person':['Sammy','Charlie','Amy','Riley','Bobby','Danny','Freddy'],
       'Sales':[200,200,340,124,243,350,267]}
comp_df= pd.DataFrame(data)

In [3]:
comp_df

     Company   Person  Sales
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
2  MICROSOFT      Amy    340
3   FACEBOOK    Riley    124
4   FACEBOOK    Bobby    243
5     AMAZON    Danny    350
6     AMAZON   Freddy    267

In [44]:
comp_df.head(3)

     Company   Person  Sales
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
2  MICROSOFT      Amy    340

In [45]:
comp_df.tail(2)

  Company  Person  Sales
5  AMAZON   Danny    350
6  AMAZON  Freddy    267

In [46]:
comp_df.describe()

            Sales
count    7.000000
mean   246.285714
std     80.847004
min    124.000000
25%    200.000000
50%    243.000000
75%    303.500000
max    350.000000

** Now you can use the .groupby() method to group rows together based on column name. For example let's group the data based on Company. This will create a DataFrameGroupBy object:**

In [6]:
list(comp_df.groupby('Company'))

[('AMAZON',
    Company  Person  Sales
  5  AMAZON   Danny    350
  6  AMAZON  Freddy    267),
 ('FACEBOOK',
      Company Person  Sales
  3  FACEBOOK  Riley    124
  4  FACEBOOK  Bobby    243),
 ('GOOGLE',
    Company   Person  Sales
  0  GOOGLE    Sammy    200
  1  GOOGLE  Charlie    200),
 ('MICROSOFT',
       Company Person  Sales
  2  MICROSOFT    Amy    340)]

In [7]:
by_comp_name = comp_df.groupby("Company")

In [8]:
by_comp_name.groups

{'AMAZON': [5, 6], 'FACEBOOK': [3, 4], 'GOOGLE': [0, 1], 'MICROSOFT': [2]}

In [50]:
by_comp_name.get_group('FACEBOOK')

    Company Person  Sales
3  FACEBOOK  Riley    124
4  FACEBOOK  Bobby    243

In [51]:
by_comp_name

In [10]:
by_comp_name.mean(numeric_only = True)

           Sales
Company
AMAZON     308.5
FACEBOOK   183.5
GOOGLE     200.0
MICROSOFT  340.0

In [11]:
by_comp_name.count()

           Person  Sales
Company
AMAZON          2      2
FACEBOOK        2      2
GOOGLE          2      2
MICROSOFT       1      1

In [54]:
by_comp_name['Person'].count()

Company
AMAZON       2
FACEBOOK     2
GOOGLE       2
MICROSOFT    1
Name: Person, dtype: int64

In [55]:
comp_df.groupby('Company').mean()

           Sales
Company
AMAZON     308.5
FACEBOOK   183.5
GOOGLE     200.0
MICROSOFT  340.0

In [56]:
by_comp_name.sum()

           Sales
Company
AMAZON       617
FACEBOOK     367
GOOGLE       400
MICROSOFT    340

In [59]:
by_comp_name.get_group('AMAZON')['Sales'].sum()

617

In [60]:
by_comp_name.min()

            Person  Sales
Company
AMAZON       Danny    267
FACEBOOK     Bobby    124
GOOGLE     Charlie    200
MICROSOFT      Amy    340

In [61]:
list(by_comp_name)

[('AMAZON',
    Company  Person  Sales
  5  AMAZON   Danny    350
  6  AMAZON  Freddy    267),
 ('FACEBOOK',
      Company Person  Sales
  3  FACEBOOK  Riley    124
  4  FACEBOOK  Bobby    243),
 ('GOOGLE',
    Company   Person  Sales
  0  GOOGLE    Sammy    200
  1  GOOGLE  Charlie    200),
 ('MICROSOFT',
       Company Person  Sales
  2  MICROSOFT    Amy    340)]

In [63]:
by_comp_name.head(2)

     Company   Person  Sales
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
2  MICROSOFT      Amy    340
3   FACEBOOK    Riley    124
4   FACEBOOK    Bobby    243
5     AMAZON    Danny    350
6     AMAZON   Freddy    267

In [ ]:
by_comp_name

In [ ]:
type(comp_df)

In [ ]:
by_comp_name.max()

In [ ]:
# the describe method gives us summary statistics of all the numeric columns in our dataset
by_comp_name.describe()

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. We will discuss these 3 methods with examples.

In [3]:
import pandas as pd

In [22]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [23]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[3, 5, 6, 7])

In [24]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[3, 9, 10, 11])

In [14]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
df2

    A   B   C   D
3  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [16]:
df3

      A    B    C    D
3    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [25]:
#here we are just glueing 3 separate dataframes together
pd.concat([df1,df2,df3], axis =0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
3    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
3    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [26]:
#remember that axis is set to 0 by default
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3   A4   B4   C4   D4   A8   B8   C8   D8
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Merging DataFrame

In [14]:
#in merging we are combining dataframes based on a key or an index

df1 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df2 = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [15]:
df1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [16]:
df2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C3  D3

In [17]:
pd.merge?

Signature:
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
) -> 'DataFrame'
Docstring:
Merge DataFrame or named Series objects with a database-style join.

A named Series object is treated as a DataFrame with a single named column.

The join is done on columns or indexes. If joining columns on
columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
on indexes or indexes on a column or columns, the index will be passed on.
When performing a cross merge, no column specifications to merge on are
allowed.

.. warning::

    If both key columns contain rows where the key is a null value, those
    rows will be matched against each other. This is different from usual SQL
    join behaviour and can lead to unexpected results.

Parameters
----------
left : DataFrame or named Series
right : DataFrame or named Series
    Object to merge with.
how : {'left', 'right', 'outer', 'inner', 'cross'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.
    * cross: creates the cartesian product from both frames, preserves the order
      of the left keys.

      .. versionadded:: 1.2.0

on : label or list
    Column or index level names to join on. These must be found in both
    DataFrames. If `on` is None and not merging on indexes then this defaults
    to the intersection of the columns in both DataFrames.
left_on : label or list, or array-like
    Column or index level names to join on in the left DataFrame. Can also
    be an array or list of arrays of the length of the left DataFrame.
    These arrays are treated as if they are columns.
right_on : label or list, or array-like
    Column or index level names to join on in the right DataFrame. Can also
    be an array or list of arrays of the length of the right DataFrame.
    These arrays are treated as if they are columns.
left_index : bool, default False
    Use the index from the left DataFrame as the join key(s). If it is a
    MultiIndex, the number of keys in the other DataFrame (either the index
    or a number of columns) must match the number of levels.
right_index : bool, default False
    Use the index from the right DataFrame as the join key. Same caveats as
    left_index.
sort : bool, default False
    Sort the join keys lexicographically in the result DataFrame. If False,
    the order of the join keys depends on the join type (how keyword).
suffixes : list-like, default is ("_x", "_y")
    A length-2 sequence where each element is optionally a string
    indicating the suffix to add to overlapping column names in
    `left` and `right` respectively. Pass a value of `None` instead
    of a string to indicate that the column name from `left` or
    `right` should be left as-is, with no suffix. At least one of the
    values must not be None.
copy : bool, default True
    If False, avoid copy if possible.
indicator : bool or str, default False
    If True, adds a column to the output DataFrame called "_merge" with
    information on the source of each row. The column can be given a different
    name by providing a string argument. The column will have a Categorical
    type with the value of "left_only" for observations whose merge key only
    appears in the left DataFrame, "right_only" for observations
    whose merge key only appears in the right DataFrame, and "both"
    if the observation's merge key is found in both DataFrames.

validate : str, optional
    If specified, checks if merge is of specified type.

    * "one_to_one" or "1:1": check if merge keys are unique in both
      left and right datasets.
    * "one_to_many" or "1:m": check if merge keys are unique in left
      dataset.
    * "many_to_one" or "m:1": check if merge keys are unique in right
      dataset.
    * "many_to_many" or "m:m": allowed, but does not result in checks.

Returns
-------
DataFrame
    A DataFrame of the two merged objects.

See Also
--------
merge_ordered : Merge with optional filling/interpolation.
merge_asof : Merge on nearest keys.
DataFrame.join : Similar method using indices.

Notes
-----
Support for specifying index levels as the `on`, `left_on`, and
`right_on` parameters was added in version 0.23.0
Support for merging named Series objects was added in version 0.24.0

Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

Merge DataFrames df1 and df2 with specified left and right suffixes
appended to any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey',
...           suffixes=('_left', '_right'))
  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
any overlapping columns.

>>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
Traceback (most recent call last):
...
ValueError: columns overlap but no suffix specified:
    Index(['value'], dtype='object')

>>> df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
>>> df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})
>>> df1
      a  b
0   foo  1
1   bar  2
>>> df2
      a  c
0   foo  3
1   baz  4

>>> df1.merge(df2, how='inner', on='a')
      a  b  c
0   foo  1  3

>>> df1.merge(df2, how='left', on='a')
      a  b  c
0   foo  1  3.0
1   bar  2  NaN

>>> df1 = pd.DataFrame({'left': ['foo', 'bar']})
>>> df2 = pd.DataFrame({'right': [7, 8]})
>>> df1
    left
0   foo
1   bar
>>> df2
    right
0   7
1   8

>>> df1.merge(df2, how='cross')
   left  right
0   foo      7
1   foo      8
2   bar      7
3   bar      8
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\reshape\merge.py
Type:      function

In [21]:
# the on argument specifies the key while the how specifies the method for merging
pd.merge(left= df1,right = df2,how='right',on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K4  NaN  NaN  C3  D3

In [94]:
left_df = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right_df = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [95]:
#we can also merge dataframes on multiple keys
pd.merge(left_df, right_df, on=['key1', 'key2'], how = 'inner')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [97]:
pd.merge(left_df, right_df, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [98]:
pd.merge(left_df, right_df, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [99]:
pd.merge(left_df, right_df, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [27]:
#the join method cobines columns based on a key

left_df = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right_df = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [20]:
left_df

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [21]:
right_df

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [23]:
left_df.join?

In [24]:
left_df.join(right_df)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [27]:
left_df.join(right_df, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

There are other data analysis operations you can perform with but dont fall under any particular category

In [110]:
comp_df

     Company   Person  Sales
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
2  MICROSOFT      Amy    340
3   FACEBOOK    Riley    124
4   FACEBOOK    Bobby    243
5     AMAZON    Danny    350
6     AMAZON   Freddy    267

In [111]:
# here we are returning all the unique values in sales column
comp_df['Company'].unique()

array(['GOOGLE', 'MICROSOFT', 'FACEBOOK', 'AMAZON'], dtype=object)

In [112]:
# we can also return the number of unique values in a column using nunique
comp_df['Company'].nunique()

4

In [113]:
# we use the value_counts method to know the count of occurence of each unique value in a column
comp_df['Company'].value_counts()

GOOGLE       2
FACEBOOK     2
AMAZON       2
MICROSOFT    1
Name: Company, dtype: int64

In [114]:
spe_comp_df = comp_df[(comp_df['Sales']>300) ]
spe_comp_df

     Company Person  Sales
2  MICROSOFT    Amy    340
5     AMAZON  Danny    350

In [115]:
#Select from DataFrame using criteria from multiple columns
spe_comp_df = comp_df[(comp_df['Sales']>300) & (comp_df['Company']=='AMAZON')]

In [116]:
spe_comp_df

  Company Person  Sales
5  AMAZON  Danny    350

In [117]:
# we can use the sort_values method to sort alphabetically or to sort in ascending and descending orders
comp_df.sort_values(by='Company')

     Company   Person  Sales
5     AMAZON    Danny    350
6     AMAZON   Freddy    267
3   FACEBOOK    Riley    124
4   FACEBOOK    Bobby    243
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
2  MICROSOFT      Amy    340

In [118]:
comp_df.sort_values(by='Company', ascending = False)

     Company   Person  Sales
2  MICROSOFT      Amy    340
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
3   FACEBOOK    Riley    124
4   FACEBOOK    Bobby    243
5     AMAZON    Danny    350
6     AMAZON   Freddy    267

In [119]:
comp_df.sort_values(by=[ 'Company', 'Sales'], ascending = False)

     Company   Person  Sales
2  MICROSOFT      Amy    340
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
4   FACEBOOK    Bobby    243
3   FACEBOOK    Riley    124
5     AMAZON    Danny    350
6     AMAZON   Freddy    267

In [120]:
comp_df.sort_values(by=[ 'Sales', 'Company'], ascending = False)

     Company   Person  Sales
5     AMAZON    Danny    350
2  MICROSOFT      Amy    340
6     AMAZON   Freddy    267
4   FACEBOOK    Bobby    243
0     GOOGLE    Sammy    200
1     GOOGLE  Charlie    200
3   FACEBOOK    Riley    124

# Data Input and Output

We will now consider the code for getting input and output data with pandas. pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [ ]:
input_df= pd.read_csv('Lemonade.csv')

In [ ]:
input_df.head(10)

In [ ]:
# here we are saving the csv format of the specified dataframe to path
input_df.to_csv('lemonade_output1.csv',index=False)

In [ ]:
new_input_df= pd.read_excel('Lemonade.xlsx')
new_input_df.head()

In [ ]:
new_input_df.dropna(axis=1).head()

In [ ]:
# pandas read method can also be used to read a table from a website with known URL
html_df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
html_df[0].head()